import newbot from "./utils/newbot.js";

const bot = await newbot();

/**
 * 获取页面源码
 * @param {string} title 标题
 * @returns {string} 页面源码
 */
const getSource = async (title) => {
    const res = await bot.request({
        action: "query",
        prop: "revisions",
        titles: title,
        rvprop: "content",
    });
    return Object.values(res.query.pages)[0].revisions[0]["*"];
};

/**
 * 提交编辑
 * @param {string} title 
 * @param {string} text 
 */
const submit = async (title, text) => {
    await bot.request({
        action: "edit",
        title,
        text,
        summary: "调整链入",
        bot: true,
        tags: "Automation tool",
        token: bot.editToken,
    });
};

const pageList = [
    "Template:日冕mod",
    "日冕(红色警戒3mod)",
    "日冕:帝国单位改动",
    "日冕:帝国建筑与科技",
    "日冕:帝国非遭遇战单位",
    "日冕:盟军单位改动",
    "日冕:盟军建筑与科技",
    "日冕:盟军非遭遇战单位",
    "日冕:神州协议",
    "日冕:神州生产建筑",
    "日冕:神州科技升级",
    "日冕:神州防御建筑",
    "日冕:神州非遭遇战单位",
    "日冕:苏联单位改动",
    "日冕:苏联建筑与科技",
    "日冕:苏联非遭遇战单位",
    "神州",
    "阿库拉潜艇(日冕)",
    "阿瑞斯截击机",
    "白虎量子重炮运输车",
    "毕方支援直升机",
    "波塞冬巡洋舰",
    "磁浮矿机",
    "磁弩自行防空系统",
    "凤凰战机(日冕)",
    "光棱坦克(日冕)",
    "光荣级巡洋舰",
    "光耀神州",
    "航空母舰(日冕)",
    "华灯初上",
    "基洛夫飞艇(日冕)",
    "计蒙驱逐舰",
    "将军战列舰(日冕)",
    "金乌轰炸机",
    "惊涛落日",
    "军部司械",
    "岚影刺",
    "联盟重型坦克",
    "凌波步兵战车",
    "龙炎军",
    "破甲铁卫",
    "破军金甲",
    "麒麟破阵战车",
    "青锋导弹车",
    "青龙战斗核心舰",
    "日晷阵列",
    "尚武精神",
    "盛世华梦",
    "世纪轰炸机(日冕)",
    "守护者坦克(日冕)",
    "苏霍伊截击机",
    "太刀重巡洋舰",
    "腾起于风",
    "薙刀驱逐舰",
    "天军行阵",
    "天眼哨机",
    "突袭驱逐舰(日冕)",
    "未来坦克 X-1(日冕)",
    "乌蓬猎船",
    "日冕:无畏级武库舰",
    "犀牛B主战坦克",
    "先锋武装炮艇机(日冕)",
    "心神机甲",
    "玄冥级战列巡洋舰",
    "玄武级攻击潜艇",
    "迅雷天罡",
    "摇光巡天炮",
    "伊尔攻击机",
    "樱花回天雷",
    "浴日神坛",
    "重锤突击炮",
    "重明截击机",
    "朱雀攻击机",
    "祝融攻坚战车",
];
const pattern = [
    ["日冕:神州", "神州"],
    ["日冕:阿库拉潜艇", "阿库拉潜艇(日冕)"],
    ["日冕:凤凰战机", "凤凰战机(日冕)"],
    ["日冕:光棱坦克", "光棱坦克(日冕)"],
    ["日冕:航空母舰", "航空母舰(日冕)"],
    ["日冕:基洛夫飞艇", "基洛夫飞艇(日冕)"],
    ["日冕:未来坦克 X-1", "未来坦克 X-1(日冕)"],
    ["日冕:突袭驱逐舰", "突袭驱逐舰(日冕)"],
    ["日冕:世纪轰炸机", "世纪轰炸机(日冕)"],
    ["日冕:守护者坦克", "守护者坦克(日冕)"],
    ["白虎攻城重炮", "白虎量子重炮运输车"],
    ["联盟超重型坦克", "联盟重型坦克"],
    ["幕府将军级战列舰", "将军战列舰(日冕)"],
    ["太刀重型巡洋舰", "太刀重巡洋舰"],
    ["玄冥战列巡洋舰", "玄冥级战列巡洋舰"],
    ["玄武导弹潜艇", "玄武级攻击潜艇"],
    ["祝融重型坦克", "祝融攻坚战车"],
    ["日冕:先锋战艇机", "先锋武装炮艇机(日冕)"],
];

for (const page of pageList) {
    let text = await getSource(page);
    console.log(`获取${page}源代码成功`);
    for (const item of pattern) {
        text = text.replaceAll(item[0], item[1]);
    }
    await submit(page, text);
    console.log(`${page}编辑完毕`);
}